import React from "react";
import styles from "./OrderProcess.module.css";
import Accordion from "../Accordion/Accordion";
import ContactUs from "../../assets/order-proccess/contact-us copy.png";
import DesignAndSize from "../../assets/order-proccess/design-and-size copy.png";

const accordionData = [
  {
    title: "Зв'яжіться з нами в зручний для вас спосіб",
    content:
      "Ви можете зателефонувати або написати у месенджері, або просто надішліть запит через наш сайт і наш менеджер зв'яжеться з вами для уточнення деталей замовлення та відповість на всі ваші запитання.",
    image: ContactUs,
  },
  {
    title: "Обговорення розмірів та дизайну",
    content:
      "Наші фахівці проведуть консультацію, під час якої будуть узгоджені всі параметри вітрини, включаючи розміри, дизайн, функціональні можливості та матеріали. Ми врахуємо всі ваші побажання та потреби, щоб створити вітрину, яка ідеально підходить для вашого бізнесу.",
    image: DesignAndSize,
  },
  {
    title: "Авансовий платіж",
    content:
      "Після узгодження всіх деталей ми підписуємо договір, у якому будуть прописані всі умови співпраці. Для початку роботи необхідно внести авансовий платіж у розмірі 50% від загальної вартості замовлення. Кошти надходять на наш офіційний рахунок. Ми також співпрацюємо з грантовими програмами, тому ви можете використовувати грантові кошти для оплати.",
    image: DesignAndSize,
  },
  {
    title: "Створення і підтвердження креслення",
    content:
      "Наші конструктори розроблять детальне креслення вітрини, враховуючи всі ваші вимоги та побажання. Креслення буде надіслане вам на затвердження. Ви матимете можливість внести корективи та уточнення, після чого ми отримаємо від вас фінальне підтвердження креслення і запускаємо в роботу.",
    image: DesignAndSize,
  },
  {
    title: "Запуск в роботу",
    content:
      "Після затвердження креслення та отримання авансу ми розпочнемо виробництво вітрини. Виробництво включає підготовку матеріалів, виготовлення всіх компонентів та їх збирання. Ми також проведемо всі необхідні тести для забезпечення якості та надійності вітрини.",
    image: DesignAndSize,
  },
  {
    title: "Доплата",
    content:
      "Перед завершенням виробництва та підготовкою до доставлення необхідно внести залишок оплати. Це забезпечить завершення всіх робіт та підготовку вітрини до відправлення.",
    image: DesignAndSize,
  },
  {
    title: "Отримання вітрини",
    content:
      "Після отримання повної оплати ми допомагаємо організувати доставлення вітрини до вашого закладу. Наші фахівці проконсультують вас щодо встановлення та допоможуть провести всі необхідні налаштування якщо вони потрібні. Ви отримаєте готовий до використання продукт, який відповідає всім вашим вимогам та стандартам якості.",
    image: DesignAndSize,
  },
];

const OrderProcess = () => {
  return (
    <div className={styles["order-process"]}>
      <h2>
        Етапи <span>замовлення</span>
      </h2>
      <Accordion data={accordionData} />
    </div>
  );
};

export default OrderProcess;
