import Model1 from "../../assets/models/1.jpg";
import Model2 from "../../assets/models/2.jpg";
import Model3 from "../../assets/models/3.jpg";
import Model4 from "../../assets/models/4.jpg";
import Model5 from "../../assets/models/5.jpg";
import Model6 from "../../assets/models/6.jpg";

export const IN_STOCK_DATA = [
  {
    name: "CAKE",
    image: Model1,
    link: "cake",
    description:
      "При розробці даної моделі головним завданням було зробити максимально прозору та легку вітрину.\n" +
      "Cake - це скло без кордонів.",
    features: [
      "скло загальне гартоване товщиною 6 мм",
      "двері зі склопакета",
      "полички регулюються по висоті",
      "є можливість вибору кольору",
      "дно холодильної камери виготовлене з харчової сталі й легко підійматися для його обслуговування",
      "спеціальне LED-світло для кондитерських виробів під кожною поличкою",
      "охолодження динамічне",
      "автоматична відтайка",
      "електронний блок управління, дводатчикова система",
      "компресор європейського виробника Aspera",
      "температурний режим вітрини 4,7°С … 11°С",
      "рекомендована температура експлуатації: в приміщенні повинно бути до 24 °C і вологість до 55%",
      "всі металеві частини фарбуються порошковою фарбою",
      "Напруга мережі живлення 220-240/50 V/HZ",
      "холодоагент  R134a",
    ],
    price: 13500,
    type: "pastry",
    width: 250,
    deep: 150,
    mirror_height: 100,
    shelves: 3,
  },
  {
    name: "ÉCLAIR",
    image: Model2,
    link: "eclair",
    description:
      "Працюючі над даною моделлю ми взяли всі переваги вітрини cake і додали полички які регулюються по висоті та дверцята зі склопакета з якими більш комфортно працювати.",
    features: [
      "скло загальне гартоване товщиною 6 мм",
      "двері зі склопакета",
      "полички регулюються по висоті",
      "є можливість вибору кольору",
      "дно холодильної камери виготовлене з харчової сталі й легко підійматися для його обслуговування",
      "спеціальне LED-світло для кондитерських виробів під кожною поличкою",
      "охолодження динамічне",
      "автоматична відтайка",
      "електронний блок управління, дводатчикова система",
      "компресор європейського виробника Aspera",
      "температурний режим вітрини 4,7°С … 11°С",
      "рекомендована температура експлуатації: в приміщенні повинно бути до 24 °C і вологість до 55%",
      "всі металеві частини фарбуються порошковою фарбою",
      "Напруга мережі живлення 220-240/50 V/HZ",
      "холодоагент  R134a",
    ],
    price: 11000,
    type: "gastronomic",
    width: 250,
    deep: 150,
    mirror_height: 100,
    shelves: 3,
  },
  {
    name: "BROWNIE",
    image: Model3,
    link: "brownie",
    description:
      "Ми створили вітрину Brownie, яка може працювати в більш агресивних умовах. В цій вітрині з'являється рамка по периметру, яку ми можемо пофарбувати згідно з таблицею RAL в колір під ваш інтер'єр.",
    features: [
      "вітрина повністю зі склопакета",
      "полички регулюються по висоті",
      "є можливість вибору кольору",
      "дно холодильної камери виготовлене з харчової сталі й легко підійматися для його обслуговування",
      "спеціальне LED-світло для кондитерських виробів під кожною поличкою",
      "охолодження динамічне",
      "автоматична відтайка",
      "електронний блок управління, дводатчикова система",
      "компресор європейського виробника Aspera",
      "температурний режим вітрини 4,7°С … 11°С",
      "рекомендована температура експлуатації: в приміщенні повинно бути до 27 °C і вологість до 65%",
      "всі металеві частини фарбуються порошковою фарбою",
      "Напруга мережі живлення 220-240/50 V/HZ",
      "холодоагент  R134a",
    ],
    price: 10000,
    type: "pastry",
    width: 250,
    deep: 150,
    mirror_height: 100,
    shelves: 3,
  },
];
